#+TITLE: Normalizing flows
#+AUTHOR: David Albandea
# #+latex_header: \documentclass[12pt,oneside,DIV=10]{article}
# #+latex_header: \input{/home/david/texmf/david/template.tex}
# #+PROPERTY: header-args :eval never-export

*** Libraries
#+begin_src jupyter-julia
using ADerrors, DelimitedFiles, Statistics, Plots, DataFrames
pyplot()
#+end_src

#+RESULTS:
: Plots.PyPlotBackend()

*** Filtering utilities and parsing
#+begin_src jupyter-julia

filterdir(dir::String, text::String) = filterdir(dir, [text])

"""
Returns vector of Strings with occurrences in the directory using regex, but
must escape \$ with \\.
"""
function filterdir(dir::String, texts::Array{String})
    dirfiles = readdir(dir)
    occurrences = filter(s -> occursin(Regex("$(texts[1])"), s), dirfiles)
    for text in texts
        occurrences = filter(s -> occursin(Regex("$text"), s), occurrences)
    end
    return occurrences
end

"""
Parses and returns information available in string `info`.
"""
function parse_info(info::String)
    L = parse(Int64, get_param(info, "L"))
    println("hi")
    beta = parse(Float64, get_param(info, "_b"))
    tau = parse(Float64, get_param(info, "_t"))
    nsteps = parse(Int64, get_param(info, "_ns"))
    return L, beta, tau, nsteps
end

function get_param(info::String, c::String)
    # Grabs the expression in parenthesis, which is whatever thing next to $c
    # except an underscore.
    return replace(info, Regex(".*$c([^_]*).*") => s"\1")
end
#+end_src

#+RESULTS:
: get_param (generic function with 1 method)

**** $\beta$ parametrization

Run the following to plot the =loss= and =ess= histories of the files in ~test~.
The function ~ana_files(betas, lambdas, Ls, ["history"], wdir=working_dir)~
would consider all the combinatorics of the inputs. Beware that ~["history"]~
bust me an input so that it does not consider the ~.pth~ models.

#+begin_src python :results output

# Analyze loss and ess
## Beta parametrization

test = ['L8_b0.586_l0.5_E5000_B250_LOSSdkl_history.txt',
 'L8_b0.6_l0.5_E5000_B250_LOSSdkl_history.txt',
 'L8_b0.65_l0.5_E5000_B250_LOSSdkl_history.txt',
 'L8_b0.7_l0.5_E5000_B250_LOSSdkl_history.txt']

ana_files(test, wdir="dumps/")
#+end_src

#+RESULTS:
#+begin_example
('L8_b0.586_l0.5_E5000_B250_LOSSdkl_history.txt',)
['L8_b0.586_l0.5_E5000_B250_LOSSdkl_history.txt']
L8_b0.586_l0.5_E5000_B250_LOSSdkl_history.txt
('L8_b0.6_l0.5_E5000_B250_LOSSdkl_history.txt',)
['L8_b0.6_l0.5_E5000_B250_LOSSdkl_history.txt']
L8_b0.6_l0.5_E5000_B250_LOSSdkl_history.txt
('L8_b0.65_l0.5_E5000_B250_LOSSdkl_history.txt',)
['L8_b0.65_l0.5_E5000_B250_LOSSdkl_history.txt']
L8_b0.65_l0.5_E5000_B250_LOSSdkl_history.txt
('L8_b0.7_l0.5_E5000_B250_LOSSdkl_history.txt',)
['L8_b0.7_l0.5_E5000_B250_LOSSdkl_history.txt']
L8_b0.7_l0.5_E5000_B250_LOSSdkl_history.txt
#+end_example

**** $\beta$ parametrization

#+begin_src python
## Beta parametrization
from tqdm import tqdm

L = 8
lattice_shape = (L,L)
beta = 0.7
lam = 0.5
phi4_action = ScalarPhi4ActionBeta(beta=beta, lam=lam)

accs = []
for i in tqdm(range(500)):
    acc, accstd = get_acceptance('dumps/L8_b0.7_l0.5_E5000_B250_LOSSdkl_model.pth', phi4_action, lattice_shape)
    accs.append(acc)
#+end_src

#+RESULTS:
: 100%|██████████████████████████████████████████████████████████| 10/10 [00:05<00:00,  1.97it/s]

*** flow HMC autocorrelation time

Here we analyze the autocorrelation of the flow HMC

#+RESULTS:
: "/home/david/git/dalbandea/phd/codes/3-Phi4/pyScalar2D"

#+begin_src jupyter-julia :results raw
wdir    = "results/flow_hmc_autocorr/"
taus    = "t"   .* string.([1.0])
nss     = "ns"  .* string.([15])
betas   = "b"   .* string.([0.7])

results = ana_files(nss, taus, wdir=wdir)

# results[results.acc .> 0.8, :]

# print_mags("mags_plainhmc.txt", plotting=true)

#+end_src

#+RESULTS:
:RESULTS:
#+begin_example
L8_b0.586_l0.5_ns15_t1.0_mag.txt
hi
   - Acc   =   0.9144939725259321
   - M     =   -0.0046547361325816996 ± 0.005469210576686525
   - τᵢ    =   3.683364872802397 ± 0.35604538717103257
   - N cfgs=   28536

L8_b0.65_l0.5_ns15_t1.0_mag.txt
hi
   - Acc   =   0.8926355352267489
   - M     =   -0.002741895374189993 ± 0.01656612394285836
   - τᵢ    =   12.09351426093583 ± 1.94540781616366
   - N cfgs=   28203

L8_b0.6_l0.5_ns15_t1.0_mag.txt
hi
   - Acc   =   0.9133482111723272
   - M     =   -0.003115620049560951 ± 0.006076615135018431
   - τᵢ    =   3.6889486898701658 ± 0.35569377028373833
   - N cfgs=   28678

L8_b0.7_l0.5_ns15_t1.0_mag.txt
hi
   - Acc   =   0.9312020280261953
   - M     =   -0.0025753850178624675 ± 0.08133591393705313
   - τᵢ    =   148.39709352037448 ± 64.25680567527183
   - N cfgs=   28402
#+end_example
\begin{tabular}{r|cccccccc}
	& L & \$\textbackslash{}beta\$ & tau & ns & M & acc & taui & dtaui\\
	\hline
	& Any & Any & Any & Any & Any & Any & Any & Any\\
	\hline
	1 & 8 & 0.586 & 1.0 & 15 & -0.00465474 +/- 0.00546921 & 0.914494 & 3.68336 & 0.356045 \\
	2 & 8 & 0.65 & 1.0 & 15 & -0.0027419 +/- 0.0165661 & 0.892636 & 12.0935 & 1.94541 \\
	3 & 8 & 0.6 & 1.0 & 15 & -0.00311562 +/- 0.00607662 & 0.913348 & 3.68895 & 0.355694 \\
	4 & 8 & 0.7 & 1.0 & 15 & -0.00257539 +/- 0.0813359 & 0.931202 & 148.397 & 64.2568 \\
\end{tabular}
:END:
